app/services/user_manager/authenticate_user.rb

    def call
      user = User.find_by_email(email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@gmail.com"], ["LIMIT", 1]]