app/services/user_manager/create_username.rb

    def create_username(fullname)
      return 'temp' if fullname.blank?

      username = fullname.parameterize(separator: '_')
      taken_usernames = User.
                        where('username LIKE ?', "#{username}%").
                        pluck(:username)
      return username unless taken_usernames.include?(username)

      User.last.with_lock do
        suffix = User.last.id
---
SELECT "users"."username" FROM "users" WHERE (username LIKE 'admin%')
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]