app/services/user_manager/create_user.rb

    def call
      params.merge!(username: username)
      user = User.create(params)
---
INSERT INTO "users" ("username", "email", "full_name", "location", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"