app/views/courses/_form.html.erb

SELECT "categories".* FROM "categories"
---

    <%= f.input :category_id,
                as: :select,
                collection: Category.all,
                prompt: 'Select Category',
                required: true %>