app/controllers/categories_controller.rb

  def index
    @categories = Category.order(name: :asc)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC

  def show
    @courses =  @category.courses.page(params[:page])
---
SELECT "courses".* FROM "courses" WHERE "courses"."category_id" = $1 LIMIT $2 OFFSET $3  [["category_id", 2], ["LIMIT", 9], ["OFFSET", 0]]

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Learning"], ["created_at", "2022-09-15 10:05:53.669060"], ["updated_at", "2022-09-15 10:05:53.669060"]]