app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (title ILIKE '%first%') LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT "courses".* FROM "courses" WHERE "courses"."category_id" = $1 LIMIT $2 OFFSET $3  [["category_id", 1], ["LIMIT", 9], ["OFFSET", 0]]
SELECT "categories".* FROM "categories"
---
  def index
    if params[:search].present?
      @query = params[:search][:query]
      @page = params[:search][:page].to_i.abs
      @courses = Course.find_course(@query).paginate(@page)
      render :search
    else
      all_courses = if params[:category_id]
                      Course.where(category_id: params[:category_id])
                    else
                      Course.all
                    end
      @courses = all_courses.page(params[:page])
      respond_to { |format| format.js } if request.xhr?
      @categories = Category.all

INSERT INTO "courses" ("title", "created_at", "updated_at", "category_id", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "first course"], ["created_at", "2022-09-14 17:49:09.314468"], ["updated_at", "2022-09-14 17:49:09.314468"], ["category_id", 1], ["author_id", 1]]
---
  def create
    @course = @user.taught_courses.new(course_params)

    if @course.save

UPDATE "courses" SET "updated_at" = $1 WHERE "courses"."id" = $2  [["updated_at", "2022-09-14 19:06:08.797028"], ["id", 3]]
---
  def update
    if @course.update(course_params)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_course
    @course = if @user.nil? || current_user.admin
                Course.find(params[:id])