app/controllers/users_controller.rb

  def index
    @users = User.order(full_name: :asc)
---
SELECT "users".* FROM "users" ORDER BY "users"."full_name" ASC