app/views/categories/_category.html.erb

  <td><%= date_parses(category.created_at) %></td>
  <td><%= category.courses.count %></td>
---
SELECT COUNT(*) FROM "courses" WHERE "courses"."category_id" = $1  [["category_id", 2]]